In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame({"Name":["Amit","Suraj","Kiran","Julkar","Anand"],"Age":[34,36,37,39,37],"Salary":[45000,60000,45500,45344,42323]})

In [3]:
df

     Name  Age  Salary
0    Amit   34   45000
1   Suraj   36   60000
2   Kiran   37   45500
3  Julkar   39   45344
4   Anand   37   42323

In [4]:
df["Age"]

0    34
1    36
2    37
3    39
4    37
Name: Age, dtype: int64

In [5]:
df["Salary"]

0    45000
1    60000
2    45500
3    45344
4    42323
Name: Salary, dtype: int64

In [6]:
# creating a Pandas Series named "Age" with the values [12, 34, 4, 33]. 
dataser=pd.Series([12,34,4,33], name="Age")  
dataser

0    12
1    34
2     4
3    33
Name: Age, dtype: int64

In [7]:
dataser.max()

np.int64(34)

In [8]:
df["Age"].max()

np.int64(39)

In [9]:
# The df.describe() method in Pandas provides a summary of the statistics for numerical columns in a DataFrame.

# count: The number of non-null entries in each column.
# mean: The average value of each numerical column.
# std: The standard deviation, which measures the amount of variation or dispersion in the dataset.
# min: The minimum value in each column.
# 25%: The first quartile, or the value below which 25% of the data falls.
# 50%: The median, or the value below which 50% of the data falls.
# 75%: The third quartile, or the value below which 75% of the data falls.
# max: The maximum value in each column.

df.describe()

            Age        Salary
count   5.00000      5.000000
mean   36.60000  47633.400000
std     1.81659   7033.148072
min    34.00000  42323.000000
25%    36.00000  45000.000000
50%    37.00000  45344.000000
75%    37.00000  45500.000000
max    39.00000  60000.000000

In [10]:
df.head(2)  # by default df.head()  5 row

    Name  Age  Salary
0   Amit   34   45000
1  Suraj   36   60000

In [11]:
df.tail(1)

    Name  Age  Salary
4  Anand   37   42323

In [12]:
df.dtypes

Name      object
Age        int64
Salary     int64
dtype: object

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Salary  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [14]:
ages=df["Age"]
ages

0    34
1    36
2    37
3    39
4    37
Name: Age, dtype: int64

In [15]:
ages.head(2)

0    34
1    36
Name: Age, dtype: int64

In [16]:
df.shape

(5, 3)

In [17]:
df["Age"].shape

(5,)

In [18]:
type(df["Age"])

pandas.core.series.Series

In [19]:
age_sal=df[["Age","Salary"]]

In [20]:
age_sal

   Age  Salary
0   34   45000
1   36   60000
2   37   45500
3   39   45344
4   37   42323

In [21]:
df[["Age","Salary"]].shape

(5, 2)

In [22]:
type(age_sal)

pandas.core.frame.DataFrame

In [23]:
age_sal.shape

(5, 2)